
module.exports = {

}

var detail= {
  "data": [
    {
      "question_id": 1,
      "title": "常见问题",
      "detail": "UJava是架构设计过程中的精华沉淀，是架构设计过程中遇到问题和解决方案的仓库，也是架构设计工具。",

    },
    {
      "question_id": 2,
      "title": "网站历史",
      "detail": "持续更新中，官方网址：http://ujava.cn",

    },
    {
      "question_id": 3,
      "title": "设计思想",
      "detail": "第一梯队思想\n" +
          "\n" +
          "          - 编程\n" +
          "          - 结构化\n" +
          "          - 关注点分离\n" +
          "          - 抽象\n" +
          "          - 封装\n" +
          "          - 复用\n" +
          "          - 分治\n" +
          "          - 组合\n" +
          "          - 缓存\n" +
          "          - 解耦\n" +
          "          - 编码\n" +
          "          - 协议\n" +
          "          - 容错\n" +
          "          - 自动化\n" +
          "          - 预处理\n" +
          "          - 时空权衡\n" +
          "          - 统筹规划\n" +
          "\n" +
          "          第二梯队思想\n" +
          "\n" +
          "          - 递归\n" +
          "          - 索引\n" +
          "          - 迭代\n" +
          "          - 遍历\n" +
          "          - 中断\n" +
          "          - 回滚\n" +
          "          - 模板\n" +
          "          - 模式\n" +
          "          - 代理\n" +
          "\n" +
          "          第三梯队思想\n" +
          "\n" +
          "          - 管道\n" +
          "          - 并发\n" +
          "          - 并行\n" +
          "          - 批量\n" +
          "          - 异步\n" +
          "          - 回调\n" +
          "          - 延迟\n" +
          "          - 定时\n" +
          "          - 通知\n" +
          "          - 阻塞\n" +
          "\n" +
          "          第四梯队思想\n" +
          "\n" +
          "          - 面向过程编程\n" +
          "          - 函数式编程\n" +
          "          - 面向对象编程\n" +
          "          - 面向过程与面向对象的区别",

    },
  ]

}

module.exports.detail = detail;